{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer": {"name": "input_layer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "42"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "29"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "29"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "29"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "42"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "42"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose", "op": "Transpose", "input": ["input_layer", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/Shape", "op": "Shape", "input": ["input_layer"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose", "op": "Transpose", "input": ["input_layer", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/Shape", "op": "Shape", "input": ["input_layer"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/Shape", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/Shape", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/packed", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/packed", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_28", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/Max", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/loop_counter", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/time", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_32", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_33", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_34", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_35"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9mb3J3YXJkX2xzdG1fMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_72", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_75", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_70", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/Max", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_69", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/loop_counter", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_73", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_74", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_71", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/time", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_76", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_77", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_5", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_78", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_6", "^StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_79"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2JpZGlyZWN0aW9uYWxfMS9iYWNrd2FyZF9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_28", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/next_iteration/_63"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_31", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/next_iteration/_66"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_26", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/next_iteration/_61"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_25", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/next_iteration/_60"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_29", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/next_iteration/_64"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_30", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/next_iteration/_65"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_27", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/next_iteration/_62"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/merge/_83", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_72", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/next_iteration/_107"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/merge/_86", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_75", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/next_iteration/_110"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/merge/_81", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_70", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/next_iteration/_105"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/merge/_80", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_69", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/next_iteration/_104"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/merge/_84", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_73", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/next_iteration/_108"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/merge/_85", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_74", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/next_iteration/_109"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/merge/_82", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/enter/_71", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/next_iteration/_106"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/cond/_23/input_control_node/_199", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_32", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_33", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/enter/_34", "^StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/merge/_36", 